package od_2024_e;

public class OD34贪心的商人 {
				/**
					* 2025/4/10
					* URL ：
					* 题目描述：一、题目描述
					* 商人经营一家店铺，有number种商品，由于仓库限制每件商品的最大持有数量是item[index]，每种商品的价格在每天是item_price[item_index][day]，通过对商品的买进和卖出获取利润，请给出商人在days天内能获取到的最大利润。
					*
					* 注：同一件商品可以反复买进和卖出；
					*
					* 二、输入描述
					* 3 //输入商品的数量 number
					* 3 // 输入商人售货天数 days
					* 4 5 6 //输入仓库限制每件商品的最大持有数量是itemlindex]
					* 1 2 3 // 输入第一件商品每天的价格
					* 4 3 2 // 输入第二件商品每天的价格
					* 1 5 3 // 输入第三件商品每天的价格
					*
					* 三、输出描述
					* 32//输出商人在这段时间内的最大利润
					*
					* 四、测试用例
					* 测试用例1
					* 1、输入
					* 2
					* 4
					* 2 3
					* 1 2 3 4
					* 2 3 4 5
					*
					* 2、输出
					* 15
					*
					* 3、说明
					* 第一件商品： (2-1)*2 + (3-2)*2 
					*
					*
					* 哪吒编程
					*
					* 微信公众号
					*
					* 领取学习资料、大厂面试真题、职业规划
					**/
				public static void main(String[] args) {
				
				
				
				
				}
}
